test_manual_run/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class dictionary;
  object blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1; // Scale factor for coordinates (1 = meters)

// Domain Bounds:
// x: -100 to 400
// y: -150 to 150
// z: -100 to 100

vertices((-100 - 150 - 100) // 0: Min X, Min Y, Min Z
         (400 - 150 - 100)  // 1: Max X, Min Y, Min Z
         (400 150 - 100)    // 2: Max X, Max Y, Min Z
         (-100 150 - 100)   // 3: Min X, Max Y, Min Z
         (-100 - 150 100)   // 4: Min X, Min Y, Max Z
         (400 - 150 100)    // 5: Max X, Min Y, Max Z
         (400 150 100)      // 6: Max X, Max Y, Max Z
         (-100 150 100)     // 7: Min X, Max Y, Max Z
);

blocks(
    // hex block from vertices 0-7
    // Cells: (x-dir: 40, y-dir: 20, z-dir: 20)
    // Grading: (1 1 1) - Uniform expansion ratio
    hex(0 1 2 3 4 5 6 7)(40 20 20) simpleGrading(1 1 1));

edges();

boundary(
    inlet {
      type patch;     // Standard inflow/outflow patch
      faces((0 4 7 3) // Face defined by vertex indices (Min X face)
      );
    } outlet {
      type patch;
      faces((1 2 6 5) // Max X face
      );
    } bottom {
      type symmetryPlane; // Symmetry condition (slip wall behavior)
      faces((0 3 2 1)     // Min Z face
      );
    } top {
      type patch;     // Atmosphere interface
      faces((4 5 6 7) // Max Z face
      );
    } side_left {
      type symmetryPlane;
      faces((0 1 5 4) // Min Y face
      );
    } side_right {
      type symmetryPlane;
      faces((3 7 6 2) // Max Y face
      );
    });

mergePatchPairs();

// ************************************************************************* //
