test_manual_run/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class dictionary;
  location "constant";
  object turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS; // Reynolds-Averaged Simulation

RAS {
  model kOmegaSST; // k-omega Shear Stress Transport model
  turbulence on;   // Turbulence modeling enabled
  printCoeffs on;  // Print model coefficients to output log
}

// ************************************************************************* //
