test_manual_run/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class volVectorField;
  object U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions[0 1 - 1 0 0 0 0]; // Velocity [m/s]

internalField uniform(10 0 0); // Initial velocity field

boundaryField {
  inlet {
    type fixedValue; // Constant velocity at inlet
    value uniform(10 0 0);
  }

  outlet {
    type inletOutlet; // Zero gradient for outflow, fixed value for inflow
                      // (backflow prev)
    inletValue uniform(10 0 0);
    value uniform(10 0 0);
  }

  bottom { type symmetryPlane; }

  top {
    type pressureInletOutletVelocity; // Velocity derived from flux, handles
                                      // open boundaries well
    value uniform(0 0 0);
  }

  side_left { type symmetryPlane; }

  side_right { type symmetryPlane; }
}

// ************************************************************************* //
